"""(Створіть клас геометричної фігури "Ромб". Клас повинен мати наступні атрибути:
сторона_а (довжина сторони a).
кут_а (кут між сторонами a і b).
кут_б (суміжний з кутом кут_а).
Необхідно реалізувати наступні вимоги:
Значення сторони сторона_а повинно бути більше 0.
Кути кут_а та кут_б повинні задовольняти умову: кут_а + кут_б = 180
Протилежні кути ромба завжди рівні, тому при заданому значенні кут_а, значення кут_б обчислюється автоматично.
Для встановлення значень атрибутів використовуйте метод __setattr__."""

class Romb:
        def __setattr__(self, name, value):
            if name == 'side_a':
                if value <= 0:    #сторона має бути більше нуля
                    raise ValueError('Що ти вводиш, знову прогулював геометрію') #Якщо перевірка не пройдена
                super().__setattr__(name, value) #записування атрибуту
            elif name == 'corner_a':
                if not (0 < value < 180): #кут повинен бути між 1 і 180
                    raise ValueError('В тебе великі проблеми з геометрією і кутом а') #Якщо перевірка не пройдена
                super().__setattr__(name, value) #записування атрибуту
                super().__setattr__('corner_b', 180 - value)  #автоматично обчислюємо суміжний кут
            else:
                super().__setattr__(name, value) #записування атрибуту

        def __init__(self, side_a, corner_a):
                self.side_a = side_a
                self.corner_a = corner_a  # автоматично обчислить corner_b

        def __str__(self):
                return f"Ромб: сторона = {self.side_a}, кут a = {self.corner_a}°, кут b = {self.corner_b}°"
#Якщо ввести текст або не ввести якісь дані помилка і так відбудеться
romb = Romb(10, 179)
print(romb)


