'''Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
[”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести
“Не можу це зробити!”
Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити” '''

def sum_numbers(s):
    try:
        numbers = [int(x) for x in s.split(',')] # Розбиваємо рядок по комі та конвертуємо в int
        return sum(numbers)
    except ValueError:
        return "Не можу це зробити!"

example = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]

for item in example:
    result = sum_numbers(item)
    print(result)
