#6.1
#Порахувати кількість унікальних символів в строці. Якщо їх більше 10 - вивести в консоль True, інакше - False.
#Строку отримати за допомогою функції input()
data = input("Enter something ")
unique_chars = set(data)
if len(unique_chars) > 10:
    print(True)
else:
    print(False)

#6.2
#Напишіть цикл, який буде вимагати від користувача ввести слово,
#в якому є літера "h" (враховуються як великі так і маленькі).
#Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".
while True:
    word = input("Введіть слово з літерою 'h' або 'H': ")
    if 'h' in word.lower():
        print("Ви ввели слово з літерою 'h'або 'H'.")
        break
    else:
        print("Слово не містить 'h' або 'H'. Спробуйте ще раз.")

#6.3
#Є list з даними lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum'].
#Напишіть код, який свормує новий list (наприклад lst2), який містить лише змінні типу стрінг, які присутні в lst1.
#Данні в лісті можуть бути будь якими
lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']
lst2 = [x for x in lst1 if isinstance(x, str)] #isinstance(x, str) у Python - це функція для перевірки типу змінної.
print(lst2)

#6.4
#Є лист з числами, порахуйте суму усіх ПАРНИХ чисел в цьому листі
#Листа з числами не знайшов, тому сам створив.
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
even_sum = 0
for num in numbers:
    if num % 2 == 0:
        even_sum += num
print("Сума парних чисел:", even_sum)